# 대분류 Asepct Category 매핑 Dictionary
# value (list) 내에 포함된 label을 key 값으로 변경
label_map_dict = {
    "가격": ["가격"],
    "품질/디자인/구성": ["품질", "디자인", "색상", "제품구성", "용기", "마감", "포장", "굽", "수납", "품질/디자인/구성",
                  "소재", "제형", "성분", "성분/재질", "재질/소재", "재질/질감"],
    "사이즈/무게/개수": ["사이즈", "무게", "용량", "용량/사이즈", "두께", "치수/사이즈", "길이", "사이즈/부피", "사이즈/용량",
                  "사이즈/폭/길이/두께", "용량/수량", "용량/개수", "사이즈/두께", "길이/폭/두께", "깊이/높이", "수량/개수"],
    "효과/성능/기능": ["기능","조작성","기능/효과","음량/음질","화질","효과/성능/기능","세척/세정력","시간/속도","보습력/수분감",
                 "흡수력","내구성","지속력/유지력","발림성","배터리","세정력/청결감","윤기/피부(톤)","내구성/견고성","지속력",
                 "머릿결관리","염색력","발색력","보습력/수분감/쿨링감","절삭력","신축성","소비전력","탈취/제습력","커버력",
                 "밀착력/접착력","농축도/수용성","탈모개선","스타일링효과","기능성","세팅력/고정력","청량감/쿨링감",
                 "세정력","탄력","코팅력","거품력","씨제거력","수분감/보습력","밀착감/접착력","분사력","클렌징/제거력",
                 "열전도성","흡착/접착력","피부(손)보호","두피보호","살균/소독","제연/냄새방지","방수성","위생/살균/성분","흡·접착력"],
    "사용감/착용감": ["향/냄새", "소음", "향", "착용감", "자극성", "착화감", "핏", "요리력", "촉감/감촉", "촉감", "사용감", "조립성",
                "호흡성/통기성", "냄새", "이염", "그립감", "피부타입"],
    "편의성/활용성": ["편의성", "편의성/사용성/활용도", "편의성/활용성", "활용성", "수납/건조공간", "사용성", "사용성/편의성",
                "연마용이성", "세척용이성", "정리성/수납력"],
    "제조/유통/서비스":["제조일/제조사", "서비스", "유통기한"]
}


# 대분류 Asepct Category Dictionary에 BIO tag 적용
label_list,label_changing_rule = [], {}
for key in label_map_dict.keys():
    if key != 'O':
        label_list.extend(['B-' + key, 'I-' + key])
    else:
        label_list.append('O')
for key, labels in label_map_dict.items():
    for label in labels:
        if key != label:
            for tag in ["B-", "I-"]:
                label_changing_rule[tag + label] = tag + key